# CurveParamConcreteCantilever Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveParamConcreteCantilever Property
ParameterTypeId Class See Also
---
"Concrete Cantilever"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveParamConcreteCantilever { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveParamConcreteCantilever As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveParamConcreteCantilever {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace